InformationRegisters/Renault_ПоврежденияКузова.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПоврежденияКузова</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньПовреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Автосервис_СтепениПовреждения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемкаИзПланшета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗонаПовреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЗоныПоврежденийАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Повреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Автосервис_Повреждения</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/DMS_ВариантыВажностиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ВариантыВажностиЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_КлассификацияОтделов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_КлассификацияОтделов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтделПродажАвтомобилей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделПродажЗапасныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделКорпоративныхПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделТрейдИн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделReception</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделКузовногоРемонта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_Задачи</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмо</xr:Item>
				<xr:Item>Document.Renault_Задачи</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.АктПриемаПередачиЦенныхБумаг</xr:Item>
				<xr:Item>Document.АктСверкиВзаиморасчетов</xr:Item>
				<xr:Item>Document.Амортизация</xr:Item>
				<xr:Item>Document.БюджетДДС</xr:Item>
				<xr:Item>Document.БюджетДоходовИРасходов</xr:Item>
				<xr:Item>Document.БюджетЗакупок</xr:Item>
				<xr:Item>Document.БюджетПродаж</xr:Item>
				<xr:Item>Document.ВводВЭксплуатацию</xr:Item>
				<xr:Item>Document.ВводОстатковВзаиморасчетов</xr:Item>
				<xr:Item>Document.ВводОстатковПрочихАктивов</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.Взаимозачет</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.Выписка</xr:Item>
				<xr:Item>Document.ВыплатаЗарплаты</xr:Item>
				<xr:Item>Document.ЗаказВнутренний</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗакрытиеНакопительныхСумм</xr:Item>
				<xr:Item>Document.ЗакрытиеПериода</xr:Item>
				<xr:Item>Document.ИзменениеАссортиментаПодразделения</xr:Item>
				<xr:Item>Document.ЗакрытиеСмены</xr:Item>
				<xr:Item>Document.ИзменениеЦен</xr:Item>
				<xr:Item>Document.ИнвентаризацияОрдерногоСклада</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.Корректировка</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПокупателя</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПоставщику</xr:Item>
				<xr:Item>Document.НазначениеСкидокШапки</xr:Item>
				<xr:Item>Document.НазначениеСкидокСтроки</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.ОбслуживаниеАктива</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ПеремещениеАктивов</xr:Item>
				<xr:Item>Document.ПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.Переоценка</xr:Item>
				<xr:Item>Document.ПереоценкаВалютныхСредств</xr:Item>
				<xr:Item>Document.ПереразмещениеТоваров</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ПланФакт</xr:Item>
				<xr:Item>Document.ПлатежноеПоручение</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ПриходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.Разукомплектация</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.РеализацияАктивов</xr:Item>
				<xr:Item>Document.СнятиеРезервовЗаказовПокупателя</xr:Item>
				<xr:Item>Document.РезервированиеЗаказовПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.СписаниеАктивов</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.СчетФактураВыданный</xr:Item>
				<xr:Item>Document.СчетФактураПолученный</xr:Item>
				<xr:Item>Document.Чек</xr:Item>
				<xr:Item>Document.ЧекНаОплату</xr:Item>
				<xr:Item>Document.АктРазногласий</xr:Item>
				<xr:Item>Document.БюджетОказанияУслугПоАвтоработам</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>Document.ЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.ИзвлечениеТоваровИзПроизводства</xr:Item>
				<xr:Item>Document.ПеремещениеТоваровВПроизводство</xr:Item>
				<xr:Item>Document.РаспределениеЗаказаПокупателя</xr:Item>
				<xr:Item>Document.БюджетЗакупокАвтомобилей</xr:Item>
				<xr:Item>Document.БюджетПродажАвтомобилей</xr:Item>
				<xr:Item>Document.ВводВЭксплуатациюАвтомобилей</xr:Item>
				<xr:Item>Document.ВводОстатковАвтомобилей</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателяАвтомобилей</xr:Item>
				<xr:Item>Document.ВозвратПоставщикуАвтомобилей</xr:Item>
				<xr:Item>Document.ЗаказНаАвтомобиль</xr:Item>
				<xr:Item>Document.ИзменениеЦенАвтомобилей</xr:Item>
				<xr:Item>Document.ИзменениеЦенОпций</xr:Item>
				<xr:Item>Document.ИнвентаризацияАвтомобилей</xr:Item>
				<xr:Item>Document.ОтчетКомиссионераЗаАвтомобили</xr:Item>
				<xr:Item>Document.ОтчетКомитентуЗаАвтомобили</xr:Item>
				<xr:Item>Document.ПеремещениеАвтомобилей</xr:Item>
				<xr:Item>Document.ПереоценкаАвтомобилей</xr:Item>
				<xr:Item>Document.РеализацияАвтомобилей</xr:Item>
				<xr:Item>Document.СнятиеРезервовАвтомобилей</xr:Item>
				<xr:Item>Document.СписаниеАвтомобилей</xr:Item>
				<xr:Item>Document.СчетНаОплатуЗаАвтомобили</xr:Item>
				<xr:Item>Document.ИзменениеЦенАвторабот</xr:Item>
				<xr:Item>Document.ПоступлениеАвтомобилей</xr:Item>
				<xr:Item>Document.ВводОстатковТоваровВПроизводстве</xr:Item>
				<xr:Item>Document.ПланПоступленияДС</xr:Item>
				<xr:Item>Document.СчетОтПоставщика</xr:Item>
				<xr:Item>Document.ЗаявкаНаРасходДС</xr:Item>
				<xr:Item>Document.ВводОстатковНакопительныхСумм</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПокупателя</xr:Item>
				<xr:Item>Document.СнятиеРаспределенияЗаказовПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеНезавершенногоПроизводства</xr:Item>
				<xr:Item>Document.СчетОтПоставщикаЗаАвтомобили</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдерНаАвтомобили</xr:Item>
				<xr:Item>Document.РазукомплектацияАвтомобилей</xr:Item>
				<xr:Item>Document.ПриходныйСкладскойОрдерНаАвтомобили</xr:Item>
				<xr:Item>Document.ПереразмещениеАвтомобилей</xr:Item>
				<xr:Item>Document.УРВ_Табель</xr:Item>
				<xr:Item>Document.ПеремещениеРезервов</xr:Item>
				<xr:Item>Document.ЗаказПоставщикуНаАвтомобиль</xr:Item>
				<xr:Item>Document.РезервированиеАвтомобилей</xr:Item>
				<xr:Item>Document.РабочийЛист</xr:Item>
				<xr:Item>Document.ЖалобаКлиента</xr:Item>
				<xr:Item>Document.СтраховойПолис</xr:Item>
				<xr:Item>Document.Рассылка</xr:Item>
				<xr:Item>Document.Опрос</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПоставщику</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаАвто</Name>
					<Comment>(задача для менеджера по продажам)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Список пользователей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ПоврежденияКузова/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		СоздатьЗадачу(Запись);
	КонецЦикла
	
КонецПроцедуры

Процедура СоздатьЗадачу(Запись)
	
	Если Renault_ЗадачаУжеЕсть(Запись.Обращение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Док = Документы.Renault_Задачи.СоздатьДокумент();
	Док.Автор = ПараметрыСеанса.Пользователь;
	Док.ВидЗадачи = Справочники.Renault_ТипыЗадач.СвязатьсяСКлиентомПовреждения;
	Док.Комментарий = "" + Строка(Запись.Автомобиль) + ", " + Запись.ЗонаПовреждения + ?(Запись.Комментарий="", "", ", " + Запись.Комментарий);
	Док.ДокументОснование = Запись.Обращение;
	Док.Приоритет = Перечисления.DMS_ВариантыВажностиЗадачи.Обычная;
	Док.Дата = ТекущаяДата();
	Для Каждого Пользователь Из ПользователиКузовногоРемонта() Цикл
		Стр = Док.Пользователи.Добавить();
		Стр.Пользователь = Пользователь;
		Стр.СостояниеЗадачи = Перечисления.СостоянияСобытий.Запланировано;
		Стр.ДатаНачалаПлан = ТекущаяДата();
		Стр.ДатаОкончанияПлан = ТекущаяДата();
		Стр.Пояснение = "Связаться с клиентов по кузовным повреждениям";
	КонецЦикла;
	
	Док.Записать();
	
КонецПроцедуры

Функция ПользователиКузовногоРемонта()
	
	Запрос=Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник В
	|			(ВЫБРАТЬ
	|				Справочник.Сотрудники.Ссылка КАК Сотрудник
	|			ИЗ
	|				Справочник.Сотрудники
	|			ГДЕ
	|				НЕ Справочник.Сотрудники.ПометкаУдаления
	|				И Справочник.Сотрудники.Подразделение В
	|					(ВЫБРАТЬ
	|						Справочник.CRM_Отделы.Подразделения.Подразделение
	|					ИЗ
	|						Справочник.CRM_Отделы.Подразделения
	|					ГДЕ
	|						Справочник.CRM_Отделы.Подразделения.Ссылка.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделКузовногоРемонта)))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция Renault_ЗадачаУжеЕсть(Приемка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Задачи.Ссылка
	|ИЗ
	|	Документ.Renault_Задачи КАК Renault_Задачи
	|ГДЕ
	|	Renault_Задачи.ДокументОснование = &ДокументОснование
	|	И Renault_Задачи.ВидЗадачи = &ВидЗадачи";
	
	Запрос.УстановитьПараметр("ДокументОснование", Приемка);
	Запрос.УстановитьПараметр("ВидЗадачи", Справочники.Renault_ТипыЗадач.СвязатьсяСКлиентомПовреждения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
